Core/src/Catalogs/ПараметрыДляОбменаДаннымиРозницаHTTP/ПараметрыДляОбменаДаннымиРозницаHTTP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыДляОбменаДаннымиРозницаHTTP</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>Default</description>
    </items>
  </predefined>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаАвансовПокупателя</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаАвансовПоставщику</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаРасчетовСПокупателем</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаРасчетовСПоставщиком</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателяРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателемРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРеглОприходованиеЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРеглОприходованиеЗапасовИнвентаризация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРеглСписаниеЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРеглСписаниеЗапасовУниформа</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеСписаниеЗапасовУниформа</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРеглСписаниеЗапасовУтилизация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеСписаниеЗапасовУтилизация</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРеглСписаниеЗапасовИнвентаризация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеСписаниеЗапасовИнвентаризация</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаКасса</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРеглКасса</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаБанковскийСчет</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРеглБанковскийСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодразделениеКассаККМ</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяКассаККМ</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьиДвиженияДенежныхСредств_ПеремещениеДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправленияДеятельности</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Справочник_Номенклатура</name>
      <description>Номенклатура</description>
    </items>
    <items>
      <name>Справочник_ХарактеристикиНоменклатуры</name>
      <description>Характеристики номенклатуры</description>
    </items>
    <items>
      <name>Документ_АвансовыйОтчет</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>Документ_АктВыполненныхРабот</name>
      <description>Акт выполненных работ</description>
    </items>
    <items>
      <name>Справочник_ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
    </items>
    <items>
      <name>Документ_ДоговорКредитаИЗайма</name>
      <description>Договор кредита и займа</description>
    </items>
    <items>
      <name>Справочник_ДоговорыКонтрагентов</name>
      <description>Договоры контрагентов</description>
    </items>
    <items>
      <name>Документ_ПриемИПередачаВРемонт</name>
      <description>Документ прием и передача в ремонт</description>
    </items>
    <items>
      <name>Документ_СборкаЗапасов</name>
      <description>Документ сборка запасов</description>
    </items>
    <items>
      <name>Документ_ЗаданиеНаРаботу</name>
      <description>Задание на работу</description>
    </items>
    <items>
      <name>Документ_ЗаказНаПроизводство</name>
      <description>Заказ на производство</description>
    </items>
    <items>
      <name>Документ_ЗаказПокупателя</name>
      <description>Заказ покупателя</description>
    </items>
    <items>
      <name>Документ_ЗаказПоставщику</name>
      <description>Заказ поставщику</description>
    </items>
    <items>
      <name>Документ_РасходДСПлан</name>
      <description>Заявка на расход денег</description>
    </items>
    <items>
      <name>Справочник_ВнеоборотныеАктивы</name>
      <description>Имущество</description>
    </items>
    <items>
      <name>Справочник_КонтактныеЛица</name>
      <description>Контактные лица</description>
    </items>
    <items>
      <name>Справочник_Контрагенты</name>
      <description>Контрагенты</description>
    </items>
    <items>
      <name>Документ_КорректировкаПоступления</name>
      <description>Корректировка поступления</description>
    </items>
    <items>
      <name>Документ_КорректировкаРеализации</name>
      <description>Корректировка реализации</description>
    </items>
    <items>
      <name>Документ_НачисленияПоКредитамИЗаймам</name>
      <description>Начисления по кредитам и займам</description>
    </items>
    <items>
      <name>Справочник_НоменклатураПоставщиков</name>
      <description>Номенклатура поставщиков</description>
    </items>
    <items>
      <name>Документ_ОперацияПоПлатежнымКартам</name>
      <description>Операция по платежным картам</description>
    </items>
    <items>
      <name>Документ_ОприходованиеЗапасов</name>
      <description>Оприходование запасов</description>
    </items>
    <items>
      <name>Справочник_Организации</name>
      <description>Организации</description>
    </items>
    <items>
      <name>Документ_ОтчетОРозничныхПродажах</name>
      <description>Отчет о розничных продажах</description>
    </items>
    <items>
      <name>Справочник_ПапкиФайлов</name>
      <description>Папки файлов</description>
    </items>
    <items>
      <name>Справочник_ПартииНоменклатуры</name>
      <description>Партии номенклатуры</description>
    </items>
    <items>
      <name>Документ_ПеремещениеДС</name>
      <description>Перемещение денег</description>
    </items>
    <items>
      <name>Документ_ПеремещениеЗапасов</name>
      <description>Перемещение запасов</description>
    </items>
    <items>
      <name>Справочник_Пользователи</name>
      <description>Пользователи</description>
    </items>
    <items>
      <name>Документ_ПоступлениеВКассу</name>
      <description>Поступление в кассу</description>
    </items>
    <items>
      <name>Документ_ПоступлениеНаСчет</name>
      <description>Поступление на счет</description>
    </items>
    <items>
      <name>Документ_ПриходнаяНакладная</name>
      <description>Приходная накладная</description>
    </items>
    <items>
      <name>Документ_ПриходныйОрдер</name>
      <description>Приходный ордер</description>
    </items>
    <items>
      <name>Справочник_Проекты</name>
      <description>Проекты</description>
    </items>
    <items>
      <name>Документ_РасходИзКассы</name>
      <description>Расход из кассы</description>
    </items>
    <items>
      <name>Документ_РасходСоСчета</name>
      <description>Расход со счета</description>
    </items>
    <items>
      <name>Документ_РасходнаяНакладная</name>
      <description>Расходная накладная</description>
    </items>
    <items>
      <name>Документ_РасходныйОрдер</name>
      <description>Расходный ордер</description>
    </items>
    <items>
      <name>Справочник_СерийныеНомера</name>
      <description>Серийные номера</description>
    </items>
    <items>
      <name>Документ_Событие</name>
      <description>Событие</description>
    </items>
    <items>
      <name>Документ_СписаниеЗапасов</name>
      <description>Списание запасов</description>
    </items>
    <items>
      <name>Справочник_СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
    </items>
    <items>
      <name>Справочник_СтруктурныеЕдиницы</name>
      <description>Структурные единицы</description>
    </items>
    <items>
      <name>Документ_СчетНаОплату</name>
      <description>Счет на оплату</description>
    </items>
    <items>
      <name>Документ_СчетНаОплатуПоставщика</name>
      <description>Счет на оплату поставщика</description>
    </items>
    <items>
      <name>Справочник_ТранспортныеСредства</name>
      <description>Транспортные средства</description>
    </items>
    <items>
      <name>Справочник_Файлы</name>
      <description>Файлы</description>
    </items>
    <items>
      <name>Справочник_ФизическиеЛица</name>
      <description>Физические лица</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Платежи</name>
      <description>Платежи</description>
    </items>
    <items>
      <name>Поступления</name>
      <description>Поступления</description>
    </items>
    <items>
      <name>ОтрицательнаяКурсоваяРазница</name>
      <description>Отрицательная курсовая разница</description>
    </items>
    <items>
      <name>ПоложительнаяКурсоваяРазница</name>
      <description>Положительная курсовая разница</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
  </predefined>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ПараметрыДляОбменаДаннымиРозницаHTTP/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураДополнительныхРеквизитов_Документ_ПриходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходнаяНакладная);
	СтруктураДополнительныхРеквизитов_Документ_ПеремещениеЗапасов = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеЗапасов);
	СтруктураДополнительныхРеквизитов_Документ_ПриходныйОрдер = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПриходныйОрдер);
	СтруктураДополнительныхРеквизитов_Документ_ОприходованиеЗапасов = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОприходованиеЗапасов);
	СтруктураДополнительныхРеквизитов_Документ_РасходнаяНакладная = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_РасходнаяНакладная);
	СтруктураДополнительныхРеквизитов_Документ_ОтчетОРозничныхПродажах = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ОтчетОРозничныхПродажах);
	СтруктураДополнительныхРеквизитов_Документ_ПоступлениеВКассу = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеВКассу);
	СтруктураДополнительныхРеквизитов_Документ_ПоступлениеНаСчет = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПоступлениеНаСчет);
	СтруктураДополнительныхРеквизитов_Документ_ПеремещениеДС = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ПеремещениеДС);
	
	СтруктураДополнительныхРеквизитов_Справочник_СтруктурныеЕдиницы = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
	
	Если НЕ ЗначениеЗаполнено(Объект.СтатьиДвиженияДенежныхСредств_ПеремещениеДС) Тогда
		Объект.СтатьиДвиженияДенежныхСредств_ПеремещениеДС = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам;
	КонецЕсли;
	
	Заполнить_ТЗ_СкладыПодразделения();
	
КонецПроцедуры

&НаСервере
Процедура Заполнить_ТЗ_СкладыПодразделения()
	
	РЕЗ = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка,
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК Тип,
		|	СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство,
		|	СтруктурныеЕдиницыДополнительныеРеквизиты.Значение
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы.ДополнительныеРеквизиты КАК СтруктурныеЕдиницыДополнительныеРеквизиты
		|		ПО СтруктурныеЕдиницы.Ссылка = СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка
		|ГДЕ
		|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка,
		|	Тип";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Склад", ВыборкаДетальныеЗаписи.Ссылка);
		МассивСтрок = ТЗ_СкладыПодразделения.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество()=0 Тогда
			ТекСтрока = ТЗ_СкладыПодразделения.Добавить();
			ТекСтрока.Склад = ВыборкаДетальныеЗаписи.Ссылка;
			ТекСтрока.Тип = ВыборкаДетальныеЗаписи.Тип;
		Иначе
			ТекСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Свойство = РЕЗ.SurplusSubdivision Тогда
			
			ТекСтрока.SurplusSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.SurplusInventorySubdivision Тогда
			
			ТекСтрока.SurplusInventorySubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffSubdivision Тогда
			
			ТекСтрока.WriteОffSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffUniformSubdivision Тогда
			
			ТекСтрока.WriteОffUniformSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffUtilizationSubdivision Тогда
			
			ТекСтрока.WriteОffUtilizationSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.WriteОffInventorySubdivision Тогда
			
			ТекСтрока.WriteОffInventorySubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Свойство = РЕЗ.SaleSubdivision Тогда
			
			ТекСтрока.SaleSubdivision = ВыборкаДетальныеЗаписи.Значение;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РЕЗ = РозницаHTTP.СтруктураДополнительныхРеквизитов(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктурныеЕдиницы);
	
	Для каждого СтрТЗ_СкладыПодразделения Из ТЗ_СкладыПодразделения Цикл
	
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.SurplusSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.SurplusSubdivision,СтрТЗ_СкладыПодразделения.SurplusSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.SurplusInventorySubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.SurplusInventorySubdivision,СтрТЗ_СкладыПодразделения.SurplusInventorySubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffSubdivision,СтрТЗ_СкладыПодразделения.WriteОffSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffUniformSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffUniformSubdivision,СтрТЗ_СкладыПодразделения.WriteОffUniformSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffUtilizationSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffUtilizationSubdivision,СтрТЗ_СкладыПодразделения.WriteОffUtilizationSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.WriteОffInventorySubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.WriteОffInventorySubdivision,СтрТЗ_СкладыПодразделения.WriteОffInventorySubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрТЗ_СкладыПодразделения.SaleSubdivision) Тогда
			
			ТекСклад = СтрТЗ_СкладыПодразделения.Склад.ПолучитьОбъект();
			РозницаHTTP.УстановитьДополнительныйРеквизит(ТекСклад,РЕЗ.SaleSubdivision,СтрТЗ_СкладыПодразделения.SaleSubdivision);
			ТекСклад.Записать();
			
		КонецЕсли;
	
	КонецЦикла; 
КонецПроцедуры
